cmsis-svd/cmsis-svd/data/Spansion/MB9BF21xS_svd.xml
        <!-- REGISTER "txvlanframes_g" -->
        <register>
          <name>txvlanframes_g</name>
          <description>"Number of good VLAN frames transmitted, exclusive of retried frames. "</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxframecount_gb" -->
        <register>
          <name>rxframecount_gb</name>
          <description>Number of good and bad frames received. </description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoctetcount_gb" -->
        <register>
          <name>rxoctetcount_gb</name>
          <description>"Number of bytes received, exclusive of preamble, in good and bad frames.  "</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoctetcount_g" -->
        <register>
          <name>rxoctetcount_g</name>
          <description>"Number of bytes received, exclusive of preamble, only in good frames. "</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxbroadcastframes_g" -->
        <register>
          <name>rxbroadcastframes_g</name>
          <description>Number of good broadcast frames received. </description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxmulticastframes_g" -->
        <register>
          <name>rxmulticastframes_g</name>
          <description>Number of good multicast frames received. </description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxcrcerror" -->
        <register>
          <name>rxcrcerror</name>
          <description>Number of frames received with CRC error. </description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxallignmenterror" -->
        <register>
          <name>rxallignmenterror</name>
          <description>Number of frames received with alignment (dribble) error. Valid only in 10/100 mode. </description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxrunterror" -->
        <register>
          <name>rxrunterror</name>
          <description>Number of frames received with runt (64 bytes and CRC error) error. </description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxjabbererror" -->
        <register>
          <name>rxjabbererror</name>
          <description>Number of frames received with length greater than 1518 bytes with CRC error. </description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxundersize_g" -->
        <register>
          <name>rxundersize_g</name>
          <description>"Number of frames received with length less than 64 bytes, without any errors.  "</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoversize_g" -->
        <register>
          <name>rxoversize_g</name>
          <description>Number of frames received with length greater than the maxsize without error. </description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx64octets_gb" -->
        <register>
          <name>rx64octets_gb</name>
          <description>"Number of good and bad frames received with length 64 bytes, exclusive of preamble. "</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx65to127octets_gb" -->
        <register>
          <name>rx65to127octets_gb</name>
          <description>"Number of good and bad frames received with length between 65 and 127 (inclusive) bytes, exclusive of preamble.  "</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx128to255octets_gb" -->
        <register>
          <name>rx128to255octets_gb</name>
          <description>"Number of good and bad frames received with length between 128 and 255 (inclusive) bytes, exclusive of preamble.  "</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx256to511octets_gb" -->
        <register>
          <name>rx256to511octets_gb</name>
          <description>"Number of good and bad frames received with length between 256 and 511 (inclusive) bytes, exclusive of preamble.  "</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx512to1023octets_gb" -->
        <register>
          <name>rx512to1023octets_gb</name>
          <description>"Number of good and bad frames received with length between 512 and 1023 (inclusive) bytes, exclusive of preamble.  "</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx1024tomaxoctets_gb" -->
        <register>
          <name>rx1024tomaxoctets_gb</name>
          <description>"Number of good and bad frames received with length between 1024 and maxsize (inclusive) bytes, exclusive of preamble. "</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxunicastframes_g" -->
        <register>
          <name>rxunicastframes_g</name>
          <description>Number of good unicast frames received. </description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
